In [1]:
#list

In [2]:
[1,2,3,4,5]

[1, 2, 3, 4, 5]

In [3]:
['India','Canada','USA','Nepal','England']

['India', 'Canada', 'USA', 'Nepal', 'England']

In [5]:
type([1,2,3,4,5])

list

In [6]:
type(['India','Canada','USA','Nepal','England'])

list

In [8]:
country_list = ['India','Canada','USA','Nepal','England']

In [9]:
type(country_list)

list

In [10]:
#Series is a list with index

In [11]:
import pandas as pd

In [12]:
df = pd.Series(country_list)

In [13]:
df

0      India
1     Canada
2        USA
3      Nepal
4    England
dtype: object

In [14]:
#Adding a column name to the following countries

In [21]:
addcol = pd.Series(country_list, name="CountryName")

In [22]:
addcol

0      India
1     Canada
2        USA
3      Nepal
4    England
Name: CountryName, dtype: object

In [23]:
type(addcol)

pandas.core.series.Series

In [24]:
#converting series to dataframe

In [25]:
df = addcol.to_frame()

In [26]:
df

  CountryName
0       India
1      Canada
2         USA
3       Nepal
4     England

In [27]:
#Adding a new column

In [28]:
#df = ('Capital')

In [29]:
#df

'Capital'

In [48]:
df1 = pd.DataFrame({'Country': ['India', 'Canada', 'USA', 'Nepal', 'England']})

In [49]:
df1['Capital'] = ['Delhi','Ottawa','Washington','Kattmandu','UK']

In [50]:
df1

   Country     Capital
0    India       Delhi
1   Canada      Ottawa
2      USA  Washington
3    Nepal   Kattmandu
4  England          UK

In [51]:
#Renaming the headings from country to Name and Capital to cap

In [52]:
df1.rename(columns ={"Country" : "Name" ,"Capital" :"Cap"})

      Name         Cap
0    India       Delhi
1   Canada      Ottawa
2      USA  Washington
3    Nepal   Kattmandu
4  England          UK

In [57]:
#Adding new data using dictionary

In [58]:
data ={
    'name' : ['iphone series'],
    'model': ['14 pro']
}

In [59]:
type(data)

dict

In [60]:
data

{'name': ['iphone series'], 'model': ['14 pro']}

In [63]:
ab = pd.Series(data)

In [64]:
ab

name     [iphone series]
model           [14 pro]
dtype: object

In [67]:
df = pd.DataFrame.from_dict(ab)

In [68]:
df

                     0
name   [iphone series]
model         [14 pro]

In [83]:
new_series ={
    'name' : 'Samsung series',
    'model' : 'S2'
}

new_series

In [84]:
type(new_series)

dict

In [85]:
df.iloc[-1] = new_series

In [90]:
new_series

{'name': 'Samsung series', 'model': 'S2'}

In [91]:
df

                     0
name   [iphone series]
model              NaN

In [92]:
new_series

{'name': 'Samsung series', 'model': 'S2'}

In [89]:
df

                     0
name   [iphone series]
model              NaN

In [96]:
df = pd.DataFrame([{'name': 'Samsung series', 'model': 'S2'}])

In [97]:
df

             name model
0  Samsung series    S2

In [98]:
df.iloc[-1]= new_series

In [99]:
new_series

{'name': 'Samsung series', 'model': 'S2'}

In [100]:
type(new_series)

dict

In [103]:
#Replacing of S2 to series2

In [112]:
df["model"]= df["model"].replace("S2" ,"Series2")

In [113]:
df

             name    model
0  Samsung series  Series2

In [114]:
#Creating a new set with numbers

In [118]:
df = pd.DataFrame(columns=['A'])

In [119]:
df

Empty DataFrame
Columns: [A]
Index: []

In [120]:
new_data = {'A': 4}

In [121]:
type(new_data)

dict

In [124]:
df1 = pd.DataFrame([new_data])

In [125]:
df1

   A
0  4

In [127]:
df = pd.concat([df,df1])

In [128]:
df

   A
0  4

In [145]:
df2 = pd.DataFrame([{'A':8}])

In [146]:
df2

   A
0  8

In [149]:
df = pd.concat([df,df2])

In [150]:
df

     A    0
0  4.0  NaN
0  NaN    A
1  NaN    8
0  8.0  NaN
0  8.0  NaN

In [134]:
!git add .

In [135]:
git commit -m "first few commands of pandas"

SyntaxError: invalid syntax (1292026115.py, line 1)

In [136]:
!git commit -m "first few commands of pandas"

[main 6fac891] first few commands of pandas
 3 files changed, 1677 insertions(+), 53 deletions(-)
 create mode 100644 .ipynb_checkpoints/basicsofpandas-checkpoint.ipynb
 create mode 100644 basicsofpandas.ipynb

In [137]:
git push

SyntaxError: invalid syntax (4238376967.py, line 1)

In [138]:
!git push

Enumerating objects: 8, done.
Counting objects: 100% (8/8), done.
Delta compression using up to 8 threads
Compressing objects: 100% (5/5), done.
Writing objects: 100% (5/5), 4.94 KiB | 1.64 MiB/s, done.
Total 5 (delta 4), reused 0 (delta 0), pack-reused 0
remote: Resolving deltas: 100% (4/4), completed with 3 local objects.
To github.com:madhuriankara/python-basics.git
   21c181e..6fac891  main -> main

In [151]:
for i in range(5):

    current_small_df = pd.DataFrame([{'A': i}])
    df = pd.concat([df, current_small_df])

In [152]:
df

     A    0
0  4.0  NaN
0  NaN    A
1  NaN    8
0  8.0  NaN
0  8.0  NaN
0  0.0  NaN
0  1.0  NaN
0  2.0  NaN
0  3.0  NaN
0  4.0  NaN

In [ ]:
#For random numbers use random

In [155]:
import random

In [159]:
for i in range(5):
    random_number =random.randint(1,100)
    current_small_df= pd.DataFrame([{'A':random_number}])
    df = pd.concat([df, current_small_df])

In [160]:
df

      A    0
0   4.0  NaN
0   NaN    A
1   NaN    8
0   8.0  NaN
0   8.0  NaN
0   0.0  NaN
0   1.0  NaN
0   2.0  NaN
0   3.0  NaN
0   4.0  NaN
0   1.0  NaN
0  32.0  NaN
0   1.0  NaN
0  90.0  NaN
0  77.0  NaN

In [167]:
df = pd.DataFrame.from_dict({'A' : [1, 2, 3]})

In [168]:
df

   A
0  1
1  2
2  3

In [169]:
df['B'] = [5,6,7]

In [170]:
df

   A  B
0  1  5
1  2  6
2  3  7

In [171]:
df['C'] = [21, 475, 890]

In [172]:
df

   A  B    C
0  1  5   21
1  2  6  475
2  3  7  890

In [173]:
import numpy as np

In [175]:
df['D'] = [55, np.nan, 567]

In [176]:
df

   A  B    C      D
0  1  5   21   55.0
1  2  6  475    NaN
2  3  7  890  567.0